{
  "url": "https://notifichedigitali.it/cittadini",
  "title": "Per i cittadini | SEND - Servizio Notifiche Digitali",
  "text": "Le tue notifiche SEND Ricevi e leggi le comunicazioni a valore legale che ti inviano gli enti aderenti, tutto in digitale. Puoi gestire le notifiche SEND e pagare eventuali costi sulla piattaforma o dall’app IO. Leggi le tue notifiche PER I CITTADINI Sempre a portata di mano Le notifiche SEND sono comunicazioni a valore legale, come esiti di pratiche, rimborsi, multe o avvisi di accertamento tributi che provengono dalle amministrazioni. Con la piattaforma SEND - Servizio Notifiche Digitali ricevi e consulti le notifiche online dove e quando vuoi con SPID o CIE o dall’app IO, e paghi eventuali costi grazie all’integrazione con pagoPA. PER PROFESSIONISTI E DITTE INDIVIDUALI Tutto in un unico spazio Se sei un libero professionista o ditta individuale, ricevi le notifiche SEND associate alla tua attività professionale sulla tua area personale: in questo modo, semplifichi la gestione amministrativa e hai un accesso rapido e sicuro a tutte le tue notifiche SEND, senza dover accedere a più piattaforme. LE NOTIFICHE SEND Scegli tu come riceverle Per inviarti le comunicazioni a valore legale, SEND dà la priorità ai tuoi recapiti digitali. In ogni momento, puoi accedere alla piattaforma SEND con SPID e CIE per indicare o aggiornare il tuo recapito legale (PEC) o i tuoi recapiti di cortesia (app IO, email e/o numero di cellulare). Se non indichi alcun recapito o non accedi alla notifica SEND da canali diversi dalla PEC entro i tempi indicati, continuerai a ricevere le notifiche tramite raccomandata cartacea. CON LA POSTA CERTIFICATA PEC Se hai indicato un indirizzo PEC, le notifiche risulteranno legalmente consegnate, senza più raccomandate cartacee. L'avviso di avvenuta ricezione che ti sarà inviato contiene il link per accedere ai documenti su SEND. SE USI IO, L'APP DEI SERVIZI PUBBLICI SEND su IO Se attivi il servizio SEND - Notifiche digitali, a ogni notifica riceverai un messaggio su IO per consultare i documenti e pagare eventuali spese direttamente in app. Se non hai un indirizzo PEC ma accedi alla notifica dall'app entro 5 giorni (120 ore) dalla sua ricezione, questa risulterà legalmente recapitata e non riceverai raccomandate cartacee. Scarica l’app: RICEVI AVVISI SULLE TUE NOTIFICHE Via email e SMS Puoi anche scegliere di ricevere un avviso di cortesia al tuo indirizzo e-mail o via SMS. Se non hai una PEC ma accedi alla notifica attraverso SEND dall'apposito link entro 5 giorni (120 ore) dalla ricezione della notifica, questa risulterà legalmente recapitata e non riceverai raccomandate cartacee. TI CONVIENE Risparmi sui costi Se accedi alle notifiche SEND tramite i canali digitali puoi risparmiare: eviti i costi connessi all'invio di raccomandate cartacee, riduci i tempi di ricezione e contribuisci alla sostenibilità, eliminando la necessità di supporti cartacei. Scopri di più E SE NON PUOI ACCEDERE TU Puoi delegare Sapevi che puoi delegare altre persone, fisiche o giuridiche, a consultare le tue notifiche online? Per farlo, accedi a SEND con SPID o CIE e inserisci nella sezione Deleghe i dati della persona che vuoi delegare. Come funziona? 01 Ricevi la notifica Per ogni notifica, SEND verifica se hai indicato una PEC per inviarti l'avviso di avvenuta ricezione. Se hai indicato altri recapiti digitali (app IO, e-mail, cellulare), invia anche un avviso di cortesia. Se non hai indicato recapiti digitali e non accedi online alla notifica, ricevi una raccomandata cartacea. 02 Leggi il contenuto Dal messaggio puoi accedere a SEND per leggere la notifica e scaricare gli allegati. Se attivi il servizio su IO, puoi consultare la notifica in app, con valore equivalente alla firma della ricevuta di ritorno di una raccomandata tradizionale e perfezionamento della notifica. 03 Paga le spese Se c'è un importo da pagare puoi saldarlo online da SEND o comodamente dall'app IO grazie a pagoPA. Se preferisci pagare allo sportello, porta con te il modulo di pagamento allegato alla notifica. SEND: il futuro delle comunicazioni a valore legale Digitali, ma davvero per tutti. Per garantire l'accesso alle notifiche SEND anche a chi non dispone di internet, identità digitale o competenze tecnologiche, è in corso la progressiva apertura di una rete di Punti di ritiro SEND su tutto il territorio nazionale, con sedi fisiche convenzionate dove puoi richiedere e ritirare in formato cartaceo una copia dei documenti notificati. Scopri i Punti di ritiro SEND",
  "language": "it",
  "lastmod": "2026-02-10T12:41:22.000Z"
}