{
  "url": "https://notifichedigitali.it/imprese",
  "title": "Per le imprese | SEND - Servizio Notifiche Digitali",
  "text": "Per le imprese Leggi, paga e archivia le notifiche SEND della tua impresa in un unico spazio, accessibile anche ai tuoi collaboratori. Semplifica la ricezione e la gestione delle comunicazioni a valore legale destinate alla tua impresa con SEND - Servizio Notifiche Digitali. Leggi le notifiche della tua impresa UNA GESTIONE PIÙ SEMPLICE Un nuovo modo per gestire le notifiche della tua impresa Con SEND leggi, paghi e gestisci le notifiche SEND destinate alla tua impresa in modo semplice, veloce e digitale. Oltre ad accedere agli atti notificati, su SEND puoi anche pagare eventuali costi grazie all’integrazione con pagoPA e conservare lo storico delle notifiche ricevute. UTENTI E GRUPPI Un lavoro di squadra Puoi abilitare più utenti all’uso della piattaforma. Così, le comunicazioni possono essere gestite da più persone, che sono aggiornate sul lavoro degli altri in tempo reale. Un modo efficace per migliorare la gestione delle notifiche all’interno dell’impresa e avere maggiore controllo delle scadenze e di quanto versato. Leggi le notifiche della tua impresa TUTTO SOTTO CONTROLLO Consulta lo storico delle notifiche SEND Per ogni notifica SEND, puoi consultare lo storico degli stati e scaricare le relative attestazioni opponibili a terzi, tutto in un unico spazio e in condivisione con i tuoi collaboratori. E SE NON PUOI ACCEDERE TU Puoi delegare Se lo desideri, puoi delegare altre persone, fisiche o giuridiche, a consultare le notifiche SEND della tua impresa online. Per farlo, accedi a SEND con SPID o CIE e inserisci nella sezione Deleghe i dati della persona che vuoi delegare. A fianco delle imprese innovative Unico Gestisci le notifiche SEND della tua impresa in un solo spazio Veloce Grazie all’integrazione con pagoPA, pagare eventuali costi è semplice e veloce Condiviso Più persone gestiscono simultaneamente le notifiche e ricevono aggiornamenti in tempo reale Conveniente Se accedi alle notifiche digitali entro i termini previsti, risparmi sui costi di stampa e invio delle raccomandate Come funziona? 01 Ricevi la notifica SEND verifica se hai indicato una PEC associata all'impresa per inviarti l'avviso di avvenuta ricezione. Se hai indicato altri recapiti digitali, invia anche un avviso di cortesia. Se non hai indicato recapiti e non accedi online alla notifica, ricevi una raccomandata cartacea. 02 Leggi il contenuto Dal messaggio puoi accedere a SEND per leggere la notifica e scaricare gli allegati. Il Rappresentate Legale dell'impresa deve fare il primo accesso a SEND per registrare l’impresa in piattaforma. 03 Paga le spese Se c'è un importo da pagare puoi saldarlo online da SEND grazie all'integrazione con pagoPA. Se preferisci pagare allo sportello, porta con te il modulo di pagamento allegato alla notifica.",
  "language": "it",
  "lastmod": "2026-02-10T12:41:24.000Z"
}